tutorials/case_axisymm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*
  =========                 |
        /  F ield         | OpenFOAM: The Open Source CFD Toolbox
       /   O peration     | Website:  https://openfoam.org
      /    A nd           | Version:  8
     /     M anipulation  |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Angle of the wedge is 5 degree
// cos pi*2.5/180 = 0.999048221581858
// sin pi*2.5/180 = 0.043619387365336

#include "../input.txt"

convertToMeters 1e-3;

vertices
(
    (0 0 0)
    ($length 0 0)
    ($length #calc "($radius)/2*0.999048221581858" #calc "($radius)/2*0.043619387365336")
    (0 #calc "($radius)/2*0.999048221581858" #calc "($radius)/2*0.043619387365336")
    (0 #calc "($radius)/2*0.999048221581858" #calc "-($radius)/2*0.043619387365336")
    ($length #calc "($radius)/2*0.999048221581858" #calc "-($radius)/2*0.043619387365336")
);

blocks
(
   hex (0 1 5 4 0 1 2 3) ($xcells $rcells 1) simpleGrading (10 0.01 1)

);

edges
(
    arc 3 4(0 $radius 0)
    arc 2 5($length $length 0)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 2 1)
        );
    }
    membrane 
    {
        type wall;
        faces
        (
            (3 2 5 4)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 4 5 1)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }
       
);

mergePatchPairs
(
);
// ****************************************************************
