tutorials/case_axisymm/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../input.txt"

transportModel  Newtonian;
nu              nu [0 2 -1 0 0 0 0] $viscosity;
D               DT [0 2 -1 0 0 0 0] $diffusivity;
Dpsi            Dpsi [0 2 -1 0 0 0 0] 1e-10;
St              St [0 0 1 0 0 0 0] 0;
Kf              Kf [0 0 -1  0 0 0 0] 0;
Kr              Kr [0 0 -1 0  0 0 0] 0;
psifact         psifact [0 0 0 0 0 0 0] 1;
rheology
{

    nu              nu [0 2 -1 0 0 0 0]    1;
    Ca              Ca [0 0  0 0 0 0 0]    1;
    Cb              Cb [0 0  0 0 0 0 0]    0;
    Cc              Cc [0 0  0 0 0 0 0]    0;
    cm              cm [0 0  0 0 0 0 0] 0.62;
}

// ************************************************************************* //
