tutorials/case_axisymm/0/c.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {   
        type            fixedValue;
        value           uniform 1;
    }  

    outlet 
    {
        type            zeroGradient;
    }


    membrane
    {
        type            dynamicRetention;
        value uniform 0;
        S uniform 0;
        RobinD   uniform 1e-5;
        RobinK   uniform -1e-5;
        forwardReaction
        {
          type constant;
        }
        backwardReaction
        {
          type constant;
        }
        Kd uniform 0;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
